{
  "entities": [
    "紅樓夢",
    "石頭記",
    "金陵十二釵",
    "風月寶鑒",
    "曹雪芹",
    "脂硯齋",
    "吳玉峰",
    "孔梅溪",
    "女媧氏",
    "大荒山",
    "無稽崖",
    "青埂峰",
    "石頭",
    "通靈寶玉",
    "空空道人/情僧",
    "警幻仙子",
    "神瑛侍者",
    "絳珠草",
    "絳珠仙子",
    "三生石",
    "赤瑕宮",
    "太虛幻境",
    "好了歌",
    "甄士隱",
    "封氏",
    "英蓮",
    "賈雨村",
    "仁清巷",
    "十里街",
    "閶門",
    "姑蘇",
    "葫蘆廟",
    "封肅",
    "霍啟",
    "北邙山",
    "西方靈河",
    "神都"
  ],
  "denoised_text": "石頭本紀\n女媧氏於大荒山無稽崖煉石補天，三萬六千五百塊石盡用，唯留一塊棄於青埂峰下。石既煉成，靈性遂通，因見暮石皆補而獨自遺棄，心生自怨。恰值僧道二人過峰，或言塵世榮華，或說出世無常；石慕紅塵，乞攜入世享受。二仙施法，化石為一塊玲瓏美玉，鐫名「通靈寶玉」，並約其入世歷劫，終還本質。\n\n因果並出\n西方靈河畔，三生石旁有絳珠草，為赤瑕宮神瑛侍者以甘露灌溉，草遂化為絳珠仙子；仙子欠恩未償，與警幻仙子、神瑛侍者之愛恨牽連，故有一干風流冤孽待下世了結。通靈寶玉被夾帶入塵，與絳珠仙子之因緣相繫，凡事由此演起。\n\n文本流傳\n空空道人得見石上文字，錄其所述，因見其情事瑣細，遂改號情僧，將《石頭記》入抄。後世傳抄、命名各有所本：吳玉峰題為《紅樓夢》，東魯孔梅溪題為《風月寶鑒》，曹雪芹削裁增刪，分章成冊，題作《金陵十二釵》，並詠一絕曰：「滿紙荒唐言，一把辛酸淚。都云作者痴，誰解其中味？」脂硯齋復以《石頭記》名存抄閱，諸家異稱，相互流傳。\n\n太虛幻境契\n石所見之夢，乃始於太虛幻境。幻境門額四字：「太虛幻境」，聯云：「假作真時真亦假，無為有處有還無。」石於幻中得通靈寶玉，既見凡情，又聞天命，遂投胎入世，親歷人間離合悲歡。\n\n金陵一隅與人物\n人世場景：姑蘇閶門之外十里街，街內仁清巷有葫蘆廟，廟畔甄家居於其側。主者甄士隱，妻封氏；獨女乳名英蓮。近里窮儒賈雨村，常寄葫蘆廟以賣文為生，與甄公相善。此等人等，正承石之所載，將為金陵十二釵諸女之一緣起。\n\n夢中贈玉與醒寤\n甄士隱夢見兩仙贈玉，得通靈寶玉一塊；未至幻境深處，驚雷喚醒，玉與幻事皆半忘。醒後見女英蓮嬌巧，日常場面與夢中警語相繫；其後事關英蓮之失、家道傾頹，乃由此幻緣而起。\n\n賈雨村之交與出資\n賈雨村於仁清巷偶見甄家丫鬟，生情懷；中秋宴飲，甄士隱濃情相邀，乃慨出五十兩銀與兩套衣物，勸雨村赴神都謀取功名。雨村受資，夢想入仕；此相助一事，顯示人物相互扶持之緣。\n\n葫蘆廟火與家道傾頹\n元宵之夜，葫蘆廟因僧人失火，火勢燒及甄家，家產盡化瓦礫。夫婦攜丫鬟投妻岳父封肅家──封肅為農人，雖殷實，然為人刻薄。此災變，石所載家事之一端，揭示命運無常、身世飄零之苦。\n\n英蓮失蹤與霍啟逃逸\n英蓮於社火之時失蹤，乳工霍啟因恐懼逃往他鄉，甄夫婦心碎，日夜憂傷；其後士隱病困，妻封氏亦因憂憂成疾。此一失落乃全書悲劇之伏筆，與通靈寶玉之因果相應。\n\n好了歌與醒世\n士隱偶遇跛足瘋道人，得聞《好了歌》歌詞一闋，歌中喻世事無常、人情易變，云：「好便是了，了便是好。」士隱悟而隨之出走，歌成書中警語，示人看破榮華、得失自明之理。\n\n關係總攝\n女媧—大荒山無稽崖—青埂峰：生石之地；石—通靈寶玉：石變玉入世；西方靈河—三生石—絳珠草—絳珠仙子—赤瑕宮—神瑛侍者—警幻仙子：情緣之源；空空道人／情僧：石文之錄者；吳玉峰、孔梅溪、曹雪芹、脂硯齋：題名、增刪與抄本之人；金陵（姑蘇閶門、仁清巷、十里街、葫蘆廟、神都、北邙山、西方靈河、赤瑕宮、太虛幻境等）：人間與彼境互相呼應之場域；核心人物：甄士隱、封氏、英蓮、賈雨村、封肅、霍啟──其家事與情緣，乃石所載故事之主要脈絡。\n\n結語\n石之有靈，因女媧遺菁，入塵以息宿緣；通靈寶玉與絳珠仙怨，絡繹不絕，遂成《石頭記》諸名本。其書既為風月閨閣瑣事之錄，亦寓人生無常、情愛因果之警；曹氏所定、脂氏所評，至今流傳，讀者自可於虛實之間，覓其深味。",
  "success": true,
  "processing_time": 73.37135100364685,
  "error": null,
  "timestamp": "2025-09-14T12:25:21.344127"
}